<template>
	<div class="chat">
		<div class="chat-box">
			尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王 尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王尬歌看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王看过噶几了啊寄过来金额阿哥理解为阿里国际啦阿胶糕了啊几个力王
		</div>
		<EnterMessage />
	</div>
</template>

<script setup>
	import { ref, onMounted } from 'vue'
	import EnterMessage from '../../components/EnterMessage/index.vue'
	onMounted(() => {
		uni.setNavigationBarTitle({
			title: '新的标题'
		});
	})
</script>

<style lang="scss" scoped>
	.chat {
		display: flex;
		flex-direction: column;
		height: calc(100vh - 44px);
		box-sizing: border-box;
		.chat-box {
			flex: 1;
			overflow: scroll;
			padding: 10px;
			box-sizing: border-box;
		}
	}
</style>